Revit 2024 API
AssetPropertyInt64 Class
 Represents a property of Int64 value.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class AssetPropertyInt64 : AssetProperty
Visual Basic
Public Class AssetPropertyInt64 _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyInt64 : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.AssetProperty
 Autodesk.Revit.DB.Visual.AssetPropertyInt64
See Also
AssetPropertyInt64 Members
Autodesk.Revit.DB.Visual Namespace